{
    "tt1860357": {
        "Plot": "\nThe film opens with actual recorded audio of a hearing from Mike Williams' testimony following the real-life aftermath of events that inspired this film.\n\nMike (Mark Wahlberg) wakes up to hear his wife Felicia (Kate Hudson) describe a dream she has in which a large rabbit is mimicking her every move. She believes the rabbit was her mother, whom Mike doesn't seem to have liked. After the two get dressed, they listen to their daughter Sydney's (Stella Allen) presentation on Mike that she is set to do for her class. Sydney talks about her dad working on an oil rig and that he \"tames the dinosaurs\". She asks her dad to bring her back a dinosaur tooth so she can back that statement up.\n\nAndrea Fleytas (Gina Rodriguez) is on her way to work, but her car won't start. She tries to fix it, but the engine craps out on her. Her boyfriend gives her a ride on his motorcycle.\n?\n\nMike and Andrea arrive at a base to be taken to the offshore oil well, Deepwater Horizon. Joining them are a number of men, including Jimmy Harrell (Kurt Russell). The whole crew is brought to the well, just as another team is leaving after they were supposed to be doing a cement log. The main crew isn't happy with the other team's departure.\n\nWhile everyone does their job, one of Mike's co-workers presents him with a real dino tooth to bring home to Sydney. He is extremely thankful.\n\nJimmy meets with the bosses, Donald Vidrine (John Malkovich) and Robert Kaluza (Brad Leland), to discuss the other team leaving before completing the cement log. Jimmy wants to do a negative pressure test on the rig to make sure things are running smoothly. They let him proceed after much back-and-forth.\n\nThe crew working by the drill perform the test on the drill pipe, resulting in a pressure of 1395. Don then has them do a test from the kill line this time, with significantly safer results. The crew then starts to pump out the mud from the system. A large buildup of mud gathers into the pipe, causing it to burst and push the crew off their feet with the blowback. The technicians manage to stop the mud from spewing. However, moments later, the earth shakes and another burst of mud spews through the hole. Methane gasses begin to rise and add pressure until the pipe can't take it anymore, and the result is a powerful explosion that sets fire to the whole rig. Jimmy is injured while taking a shower, and Mike gets knocked backwards after talking to Felicia on Skype.\n\nThe drill crew work frantically to try and contain the situation, but some of the men are killed from the explosion. Mike works with one technician, Caleb Holloway (Dylan O'Brien), in getting the men out of the rig and onto a lifeboat. Off the rig, Andrea tries to call a mayday, but she is reprimanded for her actions without authorization.\n\nThe coast guard is alerted to the situation, while Felicia learns about the fire, and she begins to worry for her husband's life.\n\nMike finds Jimmy severely injured with a beat-up eye and a bad foot after a huge shard of glass got stuck in it. Mike carries him upwards to safety, but the lifeboat is full and has taken off without them. Luckily, the coast guard has arrived and has started taking the remaining crew members with them, but another explosion prevents Mike and Andrea from making it with them. They have to climb to a higher level amid the flames in order to jump and make it safely to the boat. Andrea is too terrified to make the jump, even as Mike tries to get her to go. With no choice, he grabs Andrea and pushes her off the rig with her life jacket on. Mike jumps afterwards as well. The two are pulled to safety. The crew is then taken away as the rig continues to burn and sink.\n\nThe survivors are given medical treatment. Mike is swarmed by reporters outside a hotel, and he is shoved against a wall by a distressed man asking him if his son got off the rig. Mike goes up to his room and breaks down as he tries to take a shower. Felicia and Sydney enter the room to hold him tight. Mike gives Sydney the tooth. Afterwards, Mike and his family leave as he watches Andrea and Caleb reunite with their loved ones, while Jimmy walks in on crutches. Mike and Felicia hug him too.\n\nWe see actual footage of Mike Williams, Andrea Fleytas, and James Harrell giving testimonies in the aftermath of the disaster. Williams never returned to sea and lives in Texas with his family. Fleytas lives in California and no longer works in the oil industry. Harrell continues to work for Transocean. Donald Vidrine and Robert Kaluza were indicted on manslaughter charges, but they were later settled. The resulting oil spill lasted 87 days and spilled over 210 million gallons into the Gulf of Mexico, making it the worst oil disaster in history. 11 crew members were reported dead, and the film concludes by paying tribute to those men.\n", 
        "Rated": "PG-13", 
        "Title": "Deepwater Horizon", 
        "Ratings": [
            {
                "Source": "Internet Movie Database", 
                "Value": "7.2/10"
            }, 
            {
                "Source": "Rotten Tomatoes", 
                "Value": "84%"
            }, 
            {
                "Source": "Metacritic", 
                "Value": "68/100"
            }
        ], 
        "DVD": "10 Jan 2017", 
        "Writer": "Matthew Michael Carnahan (screenplay), Matthew Sand (screenplay), Matthew Sand (screen story), David Barstow (article), David Rohde (article), Stephanie Saul (article)", 
        "Production": "Lionsgate", 
        "Actors": "Mark Wahlberg, Kurt Russell, Douglas M. Griffin, James DuMont", 
        "Type": "movie", 
        "imdbVotes": "83,030", 
        "Website": "http://www.deepwaterhorizon.movie/", 
        "Poster": "https://images-na.ssl-images-amazon.com/images/M/MV5BOTEzNDU0OTgxM15BMl5BanBnXkFtZTgwNjA0ODM2OTE@._V1_SX300.jpg", 
        "Director": "Peter Berg", 
        "Released": "30 Sep 2016", 
        "Awards": "Nominated for 2 Oscars. Another 3 wins & 8 nominations.", 
        "Genre": "Action, Drama, Thriller", 
        "imdbRating": "7.2", 
        "Language": "English", 
        "Country": "Hong Kong, USA", 
        "BoxOffice": "$73,098,411.00", 
        "Runtime": "107 min", 
        "imdbID": "tt1860357", 
        "Metascore": "68", 
        "Response": "True", 
        "Year": "2016"
    }, 
    "tt2005151": {
        "Plot": "\nJanuary 2008, Albania - Two masked men pull David Packouz (Miles Teller) out of a trunk and start beating him. One of the men holds a gun to David's face. We hear David's voice saying what kind of gun it is, and he adds that he is an international arms dealer.\n\nWe see clips of American soldiers posing with the gear and weapons. David says that while some people see a hero serving his country, he sees thousands of dollars worth of materials. According to David, that's what war is really all about - money. Anyone who says otherwise is in on it and is supposed to keep quiet.\n\nIt's 2005 in Miami. David is a massage therapist making $75 an hour, living with his girlfriend Iz (Ana De Armas). On the side, David tries to sell bedsheets to a retirement home, but he learns that \"no one gives a shit about old people\".\n\nAt a funeral, David reunites with an old friend named Efraim Diveroli (Jonah Hill). They hang out after and try to score some weed from neighborhood drug dealers. Efraim gives them $300 for weed, but they pocket the money and ignore Efraim, showing off a gun to make him leave. Efraim walks to his car and pulls out a bigger gun from his trunk, which he starts firing off in the air to scare the dealers away.\n\nDavid and Efraim discuss Efraim's new line of business - gunrunning. He explains to David how to exploit the war on terrorism for profit. David doesn't want to get involved at first, but when he learns Iz is pregnant, he figures he needs to make more money than he does now. He lies to her and tells her that he and Efraim are selling bedsheets to the U.S. army, which she is okay with.\n\nAfter learning the ins and outs of arms dealing and checking through government contracts, David and Efraim start up their own business, AEY Inc, after getting funding from Ralph Slutzky (Kevin Pollak). Soon, the guys earn themselves a contract with the United States Department of Defense to deal weapons. However, they hit a snag when they have Berettas shipped to Jordan, unaware of Italian-made guns not being permitted to be shipped.\n\nEfraim interrupts David during a dinner party with Iz and her friends. They have a conversation outside, but Iz overhears their business and learns the truth about what David is doing, leaving her pissed.\n\nDavid and Efraim travel to Jordan and meet with smugglers that will help them retrieve the guns. They meet a man named Marlboro (Shaun Toub), who drives the guys to their destination. They stop to get gas in Fallujah, where the guys wake up and don't see Marlboro. Efraim finds a dead body inside the station, and sees that Marlboro is siphoning gas. David gets a call from Iz, who appears to forgive David for lying to her, even though the lying does bother her. Moments later, the guys see vans approaching, with men firing guns at them. David and Efraim try to get out of there, despite having an empty tank. Marlboro runs after them and hops onto the truck, filling up the tank as they drive. The guys are saved when a U.S. chopper descends, forcing the mercenaries to stop shooting.\n\nThe guys meet with Captain Santos (Patrick St. Esprit) to deliver the guns. He commends them for driving through the Triangle of Death, and the guys receive their payment.\n?\n\nPretty soon, the guys are making more money and earning more contracts. They start hiring people to work for AEY, and they start doing business with a man named Henry Girard (Bradley Cooper), who is apparently a legend with closing big deals with the army. David and Iz also welcome a baby girl named Ella. However, Efraim becomes increasingly megalomaniacal, even firing one man on the spot just for correcting him on something.\n\nDavid and Efraim then score \"The Afghan Deal\", which would allow them to supply the Afghan army with a number of weapons and ammunition. The contract came from China, which is a problem because the U.S. army has an embargo on the Chinese military industry, so Chinese ammunition is banned. Efraim has the ammo and weapons repackaged and shipped off anyway.\n\nThe guys have a falling out with their business when David and Efraim sort out their share of the payment. When David calls Efraim out on screwing people over, Efraim has the two men from the opening of the movie kidnap David and assault him. David breaks off his partnership with Efraim, especially after Efraim refuses to pay David and Ralph back for thousands of money owed to both of them. David decides to just go back to being a massage therapist.\n\nDavid gets a call from a reporter regarding an investigation into the Afghan Deal. He knows he's in trouble. He heads down an elevator and meets Efraim in there. Efraim tries to make it look like he's sorry and that he considers David a friend, but David sees through the facade, which Efraim admits. David punches Efraim in the face. When they get downstairs, they are greeted by a whole team of FBI agents, and the two are arrested.\n\nDavid's voiceover says that Ralph was in on it with the FBI, but he gets apprehended as well. What did them in, however, was the packaging guy that Efraim never paid, so he ratted them out. Both men were charged with conspiracy and fraud. Efraim was sentenced to four years in prison, while David served seven months house arrest, allowing him to stay with Iz and Ella.\n\nThe last scene has David meeting with Henry. He starts asking a bunch of questions regarding their deals, until Henry pulls out a case full of money, which he offers to David on the promise of \"no more questions.\"\n", 
        "Rated": "R", 
        "Title": "War Dogs", 
        "Ratings": [
            {
                "Source": "Internet Movie Database", 
                "Value": "7.1/10"
            }, 
            {
                "Source": "Rotten Tomatoes", 
                "Value": "60%"
            }, 
            {
                "Source": "Metacritic", 
                "Value": "57/100"
            }
        ], 
        "DVD": "22 Nov 2016", 
        "Writer": "Stephen Chin (screenplay), Todd Phillips (screenplay), Jason Smilovic (screenplay), Guy Lawson (Rolling Stone article \"Arms and the Dudes\")", 
        "Production": "Warner Bros. Pictures", 
        "Actors": "Miles Teller, Steve Lantz, Gregg Weiner, David Packouz", 
        "Type": "movie", 
        "imdbVotes": "95,546", 
        "Website": "http://www.wardogsthemovie.com/", 
        "Poster": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNzQ0NzM4MV5BMl5BanBnXkFtZTgwMDI0ODM2OTE@._V1_SX300.jpg", 
        "Director": "Todd Phillips", 
        "Released": "19 Aug 2016", 
        "Awards": "Nominated for 1 Golden Globe. Another 1 nomination.", 
        "Genre": "Comedy, Crime, Drama", 
        "imdbRating": "7.1", 
        "Language": "English, Arabic, Albanian, Romanian", 
        "Country": "USA, Cambodia", 
        "BoxOffice": "$43,017,433.00", 
        "Runtime": "114 min", 
        "imdbID": "tt2005151", 
        "Metascore": "57", 
        "Response": "True", 
        "Year": "2016"
    }, 
    "tt4160708": {
        "Plot": "\nThree Detroit friends - Rocky (Jane Levy), Alex (Dylan Minnette), and Money (Daniel Zovatto) - break into the home of wealthy owners. After Alex disables the security system, they begin to grab the nicest-looking items they can get their hands on. When they're done, they throw a rock through the plate glass door and run.\n\nRocky lives with her little sister Diddy (Emma Bercovici) and their abusive mother Ginger (Katia Bokor) and her boyfriend Trevor (Sergej Onopko). Rocky promises to Diddy that she will get both of them out of there so they can start a new life in California.\n\nMoney gets a tip from one of his connects about a man living in a house with more than $30K stashed somewhere. It's been said that the man is a war veteran and that he lives alone after his daughter was killed in a car accident. Rocky is on board since this could be the last robbery they ever have to pull off, but Alex doesn't agree with the plan. He later relents when Rocky begs him, as he has a crush on her, even though she's with Money.\n\nThe three stalk the man's (Stephen Lang) house and learn that he is blind. Alex thinks it's messed up to rob a blind guy, but Money says it doesn't mean he's a saint if he's blind. The man's rabid dog then jumps on the car door and frightens the friends.\n\nThat night, the three initiate the robbery. Alex spots a tattoo on Rocky's wrist that's new, which is of a ladybug. She explains that as a child, her father left her family and her mother blamed Rocky for it. She would cry and then get locked in the trunk. One time, a ladybug flew into the trunk and kept her company. She says she'll have it colored in California and then never mark her body again.\n\nThe friends head toward the man's house. Money drugs the dog to get him to knock out, allowing them a safe entry into the house. Rocky goes in first and disables the security system. While her friends wait for her, Money taunts Alex for his crush on Rocky. She returns and opens the door. Money goes upstairs and finds the Blind Man sleeping with the TV on. The Blind Man rises and hears a noise. He just turns the TV off and goes back to sleep. Money gasses the room to ensure that the man won't hear anything.\n\nThe three find a locked door that leads to the basement. They think this is where they'll find the man's stash. Money starts to break down the door, leading the Blind Man to go downstairs. Money starts talking and says he doesn't want trouble, until he decides to pull a gun out on the man. The Blind Man takes a few steps forward as Money holds the gun in his face. As he slowly gets closer, the man grabs the gun from Money's hand and pins him against the wall. The Blind Man asks Money how many of them there are in the house. Money says it's just him and he pleads for the man to let him go. The Blind Man loosens his grip, but then shoots Money in the neck and through the head. He drops Money's body to the floor, and Rocky hides in the closet. The man enters and opens a safe containing his money. Rocky sees the code as he leaves.\n?\n\nAlex goes to find Rocky after the Blind Man starts locking up all the doors and windows. They decide that they just have to sneak in through the basement and out the cellar door that leads outside. First, Rocky opens the safe and puts all the money in her bag. They head toward the basement, but the man emerges from there. The two keep quiet as he holds Money's gun. Someone's phone goes off, and he fires a quick shot. Rocky and Alex then head downstairs as the man drags Money's body outside.\n\nIn the basement, Rocky is startled by a woman (Franciska Toroscik) who's been chained up to the wall. Rocky and Alex are freaked out and almost leave her until the woman holds up a newspaper article. It reveals that her name is Cindy, and that she's the woman who accidentally killed the Blind Man's daughter, but she was acquitted. Rocky and Alex free her and carry her toward the cellar door. Unfortunately, the Blind Man is there when they open it. He fires the gun and strikes Cindy in the face, killing her. Rocky and Alex hide, and the man finds out he shot Cindy. He cries over her body and yells in rage. Alex picks up the man's keys and decides to try and make it back to the front door. As he and Rocky head back upstairs, the Blind Man turns off the lights in the basement, leaving them all in total darkness. Rocky and Alex feel around for each other as the man shoots the gun. Rocky almost touches the Blind Man until Alex calls her name. The Blind Man catches Alex and tries to shoot, but his gun is empty. Alex pushes a shelf down on him, trapping him. He and Rocky run upstairs.\n\nAlex holds the door closed with a crowbar. He and Rocky try to open the door, only to find the dog has woken up and is ready to attack them. They run from the dog and trap it in a room. Unfortunately, the Blind Man has gotten out of the basement and he attacks Alex. He punches him multiple times in the face and appears to impale him with garden shears. He then finds Rocky and knocks her out too.\n\nRocky wakes up in the basement, chained in the same spot as Cindy. She tells the Blind Man that this won't bring his daughter back. He says that's not entirely true. He impregnated Cindy to give him a child to make up for the one she killed, and he would have let her go once she gave birth. With Cindy dead, his unborn child has died as well, and he holds Rocky accountable. He cuts open a hole in Rocky's pants and grabs a baster filled with his semen sample. He prepares to impregnate Rocky, but luckily, Alex has gotten up and grabbed a hammer. He whacks the Blind Man over the head and frees Rocky. They handcuff the man to a pole. She starts kicking the man and then stuffs the baster down his throat. They leave him alone and decide not to involve the cops since the man could easily tell the cops that Rocky and Alex broke in.\n\nThe two head back upstairs to leave. They manage to open the front door, but the Blind Man has gotten up and he shoots Alex dead. Rocky makes a run for it, just as the man lets the dog out. Rocky runs back to Money's car and tries to make it in before the dog gets her, but she dropped her bag outside the car. Rocky opens the trunk to try and trap the dog in there so she can get out. Her plan works, and she goes outside to get the money, but the Blind Man comes out and knocks Rocky out again.\n\nThe Blind Man drags Rocky back to his house to finish his job. A ladybug flies onto Rocky's hand, giving her a boost of confidence and hope. Rocky grabs the control to set off the security system, causing the alarm to distract the man. She grabs the crowbar and whacks the Blind Man over the head multiple times until he falls into the basement and has his gun go off, shooting him in the side. Rocky takes the money and leaves the house before the cops show up.\n\nRocky is now with Diddy at the airport, ready to start their new lives. Rocky then sees a news report on TV, stating that the Blind Man was found alive and that only two burglars were reported as breaking into his home, and that he killed both of them. Rocky becomes nervous and then takes Diddy with her, never to look back again.\n", 
        "Rated": "R", 
        "Title": "Don't Breathe", 
        "Ratings": [
            {
                "Source": "Internet Movie Database", 
                "Value": "7.2/10"
            }, 
            {
                "Source": "Rotten Tomatoes", 
                "Value": "87%"
            }, 
            {
                "Source": "Metacritic", 
                "Value": "71/100"
            }
        ], 
        "DVD": "29 Nov 2016", 
        "Writer": "Fede Alvarez, Rodo Sayagues", 
        "Production": "Ghost House Pictures", 
        "Actors": "Stephen Lang, Jane Levy, Dylan Minnette, Daniel Zovatto", 
        "Type": "movie", 
        "imdbVotes": "112,300", 
        "Website": "http://www.dontbreathe-movie.com/site/", 
        "Poster": "https://images-na.ssl-images-amazon.com/images/M/MV5BZGI5ZTU2M2YtZWY4MC00ZDFhLTliYTItZTk1NjdlN2NkMzg2XkEyXkFqcGdeQXVyMjY5ODI4NDk@._V1_SX300.jpg", 
        "Director": "Fede Alvarez", 
        "Released": "26 Aug 2016", 
        "Awards": "2 wins & 21 nominations.", 
        "Genre": "Crime, Horror, Thriller", 
        "imdbRating": "7.2", 
        "Language": "English, Ukrainian", 
        "Country": "USA", 
        "BoxOffice": "$89,210,468.00", 
        "Runtime": "88 min", 
        "imdbID": "tt4160708", 
        "Metascore": "71", 
        "Response": "True", 
        "Year": "2016"
    }, 
    "tt4651520": {
        "Plot": "\nAmy Mitchell (Mila Kunis) is an overworked mother of two. Between caring for her kids Dylan (Emjay Anthony) and Jane (Oona Laurence), doing her job, going to PTA meetings, and just handling a bunch of things all at once, she barely has time for herself and is rarely rewarded with gratitude.\n\nThe PTA is run by \"perfect mom\" Gwendolyn James (Christina Applegate), who is always followed by her two lackeys Stacy (Jada Pinkett-Smith) and Vicky (Annie Mumolo). Gwendolyn is always getting Amy to go to PTA meetings even though they are ridiculous and Gwendolyn is overbearing and crazy. Amy's job is mostly part-time at a coffee company, and her boss Dale (Clark Duke) is an idiot, while her other co-workers are lazy millenials.\n\nDuring dinner, Jane freaks out about the postings for the soccer team that night, which in turn makes Amy freak out. The two go online and see that Jane made the team, and they get excited. Moments later, Amy walks into her man-child husband Mike's (David Walton) office to find him jerking off. She thinks it's porn and doesn't care at first until the woman onscreen turns out to be someone on a webcam. When Amy asks how long this has been going on, the woman says about ten months, and Mike admits he developed feelings for the woman. Amy kicks Mike out of the house.\n\nThe next day, the family's dog Roscoe isn't feeling well, so Amy has to take him with her as she drops the kids off at school. Gwendolyn startles her, making her spill coffee on herself. She asks Amy to attend a PTA meeting that afternoon regarding a bake sale. Amy heads off to the vet and is told she has to carry the dog all day since he has vertigo. This makes Amy miss an important meeting at work. She is then late to pick up Dylan and Jane from school, and Jane is late for her first day of soccer practice. They head over, and Amy accidentally hits a bus, knocking off her side mirror. As Amy tries to explain herself to the coach, a kid slides down the field and knocks Amy down.\n\nAmy begrudgingly attends the PTA meeting with the other moms. Gwendolyn restricts the moms from bringing anything to the bake sale that contains basically any ingredient used in a baked good. When she assigns Amy the job of weeding out the bad ingredients, Amy puts her foot down and states what a hectic day she's had, and how she is tired of all the nonsense, so she quits the PTA.\n\nLater, Amy goes to a bar and meets two other moms, stay-at-home Kiki (Kristen Bell) and always-horny Carla (Kathryn Hahn). They both praise Amy for saying what they've always been too afraid to say. The three of them have drinks and discuss the hardships of motherhood. They decide that instead of being role model moms, they want to be \"bad moms\" that do whatever the hell they want to do. They start by going to the supermarket and making a mess by eating whatever they want and making a chocolate milk martini.\n\nAmy wakes up disheveled and doesn't bother to make the kids breakfast. She takes them to school in Mike's car and then has a nice quiet breakfast by herself like she's fantasized, blowing off work. When Dale calls her on speakerphone, she lets her co-workers know what a crappy boss he is.\n\nAmy meets up with Kiki and Carla to go to the movies. They get food afterwards, where Kiki's husband Kent (Lyle Brocato) appears and essentially makes her ditch her friends and return home to watch their kids, which puts off Amy and Carla.\n\nThe school holds its bake sale, and Amy just brings store-bought doughnut holes. She's approached by the handsome widowed father Jessie (Jay Hernandez), who shows interest in Amy. Gwendolyn comes over and smacks the box off the table, threatening to bring Amy down for messing with her organized bake sale. She storms off and knocks another mom's cupcakes over.\n?\n\nAmy is taking Jane to a Mandarin class, but since she doesn't like it, Amy instead treats Jane to a spa day at the place where Carla works since she could sneak them in. Amy accidentally lets it slip that she and Mike are splitting up, which upsets Jane, but Amy tries to comfort her.\n\nThat night, Amy decides she wants to get laid since she's only ever had sex with Mike, and that hasn't been in ages. Kiki and Carla pick out a sexy dress for Amy while also make fun of her \"mom bra\". The ladies go out to a bar, but every guy that Amy comes across gets put off by her acting too much like a mom and talking about being a mom. Jessie and his buddies show up, leaving him and Amy to sit and talk together. Jessie talks about how he's noticed what a good job Amy does with her kids, leading to them making out.\n\nGwendolyn forces the soccer coach to bench Jane to get back at Amy. When Amy finds out it was Gwendolyn, she confronts her and challenges her to become the new head of the PTA. With Kiki and Carla's help, they spread word to the other moms about Amy running for the position.\n\nDylan complains to Amy about her not finishing his school project for him and for not making breakfast anymore. She tells him that he's become entitled and that he'll grow up to be rotten if he keeps it up, so he can be influenced to change.\n\nAmy, Kiki, and Carla hold a party for the moms to get them to vote for her. Only one mom shows up, and that's just because Carla threatened to bang her husband. The other moms are at Gwendolyn's party since she hired Martha Stewart. However, Gwendolyn bores the other moms by suggesting they have year-round school. The mom at Amy's party texts the other moms, and everyone leaves to go to her house. They end up having way more fun, and Martha even heads over with jello shots. Gwendolyn, Stacy, and Vicky go over to Amy's house to watch her give a speech on doing less instead of overworking themselves and their kids. The moms cheer for Amy, but Gwendolyn decides it's time to fight back. She and her cohorts sneak into the school at night and slip something into a locker.\n\nAfter the party, Jessie shows up to Amy's house after getting a \"disturbing\" text message written by Carla. The two end up having sex.\n\nAmy gets a surprise when Mike returns home and claims that he wants to work things out. She wants him to go to therapy with her, which he dreads. The two end up going and meeting with Dr. Karl (Wanda Sykes). When she makes Amy and Mike roleplay as each other, their true feelings come out, in which Mike says Amy is a perfectionist and Amy says that Mike is good for nothing, and the two of them just aren't in love anymore. Dr. Karl realizes their marriage can't be fixed and suggests they divorce immediately. The two leave, but they apologize to each other and part on better terms.\n\nAmy gets a phone call from Principal Burr (Wendell Pierce), who asks her to go to the school. A bag of joints was found in Jane's locker, and Burr was apparently tipped off by a concerned parent. Amy knows it was Gwendolyn, but Burr still kicks Jane off the soccer team. Jane runs out in tears, and Amy follows. Jane tells her that she's become selfish and has neglected her parental duties in favor of hanging out with her new friends. Jane and Dylan (and the dog) end up staying with Mike for a little bit. To top it all off, Amy gets fired for not showing up to work lately. This leaves Amy alone and despaired.\n\nThe night of the PTA elections arrives. Gwendolyn gives a long speech, leaving Kiki and Carla to go to Amy's house, where she is miserably watching a movie. The two inspire her to get up on her feet and get back at Gwendolyn for hurting Jane. They drive off to the school. Kiki gets a call from Kent, who is left alone with the kids. He demands that she come home, but she finally stands up for herself and tells him it's his turn to deal with the kids. Amy and Carla are very proud.\n\nThe ladies arrive just as it's Amy's turn to give a speech. She is unprepared, but she goes up to give an improvised speech. Amy admits that she is not a perfect mom, and that being a mom in this day and age is impossible. The other moms relate and applaud her honesty. It inspires other moms to stand up and express their true sentiments over their day-to-day responsibilities. The moms all cheer for Amy, while Gwendolyn leaves, knowing she is defeated.\n\nAmy wins the election and celebrates with her friends. She then sees Gwendolyn crying in her car. Amy approaches her and talks to her. Gwendolyn admits that her life is anything but perfect, and how it's taken a huge toll on her. She apologizes to Amy for what she did to Jane, and Amy forgives her.\n\nThe kids return to the house. Jane is back on the soccer team, and she thanks her mom and apologizes for acting out on her. Dylan surprises Amy by making her a frittata for breakfast. Amy drives the kids to school and gets a call from Dale, who begs her to come back to work since the place is falling apart without her. Amy agrees to come back on the condition that she gets paid more and that her work schedule becomes more flexible. Amy drops the kids off and meets with Kiki and Carla. As they decide on what they should do that day, Gwendolyn pulls up in her car and invites the ladies to join her. They decide to take Gwendolyn's husband's private jet to wherever they want to go.\n\nDuring the credits, we see Mila Kunis, Kristen Bell, Kathryn Hahn, Christina Applegate, Jada Pinkett-Smith, and Annie Mumolo with their mothers all discussing their lives as mothers and daughters back then and today, and how much they all love each other.\n", 
        "Rated": "R", 
        "Title": "Bad Moms", 
        "Ratings": [
            {
                "Source": "Internet Movie Database", 
                "Value": "6.2/10"
            }, 
            {
                "Source": "Rotten Tomatoes", 
                "Value": "58%"
            }, 
            {
                "Source": "Metacritic", 
                "Value": "60/100"
            }
        ], 
        "DVD": "01 Nov 2016", 
        "Writer": "Jon Lucas, Scott Moore", 
        "Production": "Block Entertainment", 
        "Actors": "Mila Kunis, Kathryn Hahn, Kristen Bell, Christina Applegate", 
        "Type": "movie", 
        "imdbVotes": "62,381", 
        "Website": "http://stxmovies.com/badmoms/", 
        "Poster": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNzE5MTgwNl5BMl5BanBnXkFtZTgwNjM4OTA0OTE@._V1_SX300.jpg", 
        "Director": "Jon Lucas, Scott Moore", 
        "Released": "29 Jul 2016", 
        "Awards": "2 wins & 3 nominations.", 
        "Genre": "Comedy", 
        "imdbRating": "6.2", 
        "Language": "English, Russian", 
        "Country": "USA", 
        "BoxOffice": "$113,217,955.00", 
        "Runtime": "100 min", 
        "imdbID": "tt4651520", 
        "Metascore": "60", 
        "Response": "True", 
        "Year": "2016"
    }, 
    "tt3464902": {
        "Plot": "\nThe film opens with a woman driving down a road until she reaches a field with two small donkeys. She gets out of her car and shoots one of the donkeys until it is dead.\n\nWe meet David (Colin Farrell) as he checks into the Hotel with his brother, who has been turned into a dog. In the City, people are given 45 days to find a romantic partner or else they are to be turned into an animal of their choice. David meets with the Hotel Manager (Olivia Colman) and says he would like to be turned into a lobster since they live to be 100 years.\n\nDuring breakfast, David observes three women - the Heartless Woman (Angeliki Papoulia), who is said to have no emotions; the Biscuit Woman (Ashley Jensen), who is always seen with a small pack of biscuits; and the Nosebleed Woman (Jessica Barden). David becomes acquainted with two men - Robert (John C. Reilly), who speaks with a lisp; and John (Ben Whishaw), who walks with a limp. Later, during an assembly, John is called up to speak. He says that his father left his mother for another woman, and so she was turned into a wolf and brought to live in a zoo. He would visit her enclosure until he climbed in to give her a hug. The other wolves attacked him, leaving him with his limp, but two wolves stayed still, and he figured one of them was his mother.\n\nThroughout their stay, the singles attend dances to meet one another. They are also given extra time by going on hunts and finding loners in the woods to tranquilize. The Heartless Woman is said to be the best hunter due to her cold and unfeeling nature. On the bus ride to the hunt, David sits next to the Biscuit Woman, who propositions him and then says she may jump out the window of her room.\n\nMasturbation is restricted at the hotel, and so the men can only receive moderate sexual stimulation (without orgasm) from the Maid (Ariane Labed). The Hotel Manager finds out that Robert was masturbating repeatedly, and she forces him to have his fingers burnt in a toaster as punishment. Meanwhile, John pursues the Nosebleed Woman by faking a nosebleed problem by banging his face against something. They eventually fall in love and are moved to a bigger room for the two of them.\n\nThe Biscuit Woman jumps out her window and is left on the ground, bleeding and screaming in agony. David approaches the Heartless Woman and makes brash comments regarding the Biscuit Woman's demise. They then go into a jacuzzi together. The Heartless Woman pretends to choke on an olive from her martini, and when David doesn't try to help her, she decides they are a good match. The two are then moved into the bigger bedroom, though David must continue pretending to be as heartless as she is. They run into John and the Nosebleed Woman, along with a little girl named Elizabeth (Laoise Murphy) assigned to be their daughter. John tells Elizabeth to give David a kiss, but he responds by kicking her in the shin so she can limp like her dad.\n\nThe Heartless Woman tells David she killed his brother by kicking him repeatedly. She has blood on her leg. David pretends to be unmoved, but when he sees the dead dog in the bathroom, he starts crying, and the Heartless Woman slaps him for lying. She goes to tell the Hotel Manager, but, with help from the Maid, David tranquilizes the Heartless Woman and drags her into the transformation room to be turned into an unknown animal.\n?\n\nDavid flees from the Hotel and goes into the woods where he meets a group of Loners. The Loner Leader (Lea Seydoux) welcomes David, but tells him that any romantic interaction is forbidden and is punishable. David sees one man with bandages on his mouth. He is told that the man was given \"the red kiss\", in which he had his lips cut off, along with another woman who suffered the same fate, and they were forced to kiss each other. The worse punishment is said to be \"the red intercourse\", which one can only imagine as to how it goes.\n\nDuring his stay there, David falls for the Short-Sighted Woman (Rachel Weisz). He wins her over by catching and killing rabbits, and then cooking them in a way specific to her liking. David also encounters Robert, who wants to shoot him and bring him back to the Hotel, but the Short-Sighted Woman knocks him out.\n\nThe Loners take trips into the city pretending to be couples. David is paired with the Short-Sighted Woman, and they are able to go by as a real couple without trouble. It is also revealed that the Maid is working with the Loner Leader and gathering information from the Hotel.\n\nThe Loners then break into the Hotel while David boards a yacht that John and his new family are in. David tries to break them up, but neither of them want to hear what he has to say, and he leaves the yacht. In the Hotel, the Loner Leader goes into the room of the Hotel Manager and her husband. She holds the Manager at gunpoint and asks her husband if he loves her. He says yes, but when given a gun to shoot her, the husband pulls the trigger, but the gun is empty. The Loners leave the two alone.\n\nThe Loner Leader notices how close David and the Short-Sighted Woman have become. She then discovers the woman's journal and reads about her plan to escape with David into the City. The Loner Leader and the Maid take the Short-Sighted Woman into the City to have an operation that they claim will cure her vision, but in reality, they have her blinded. The woman is left to defend herself with a knife, which the other two women try to take away from her, but the woman stabs the Maid and leaves her to die.\n\nLater, David attacks the Loner Leader and ties her up. He throws her in an open grave and leaves her to the mercy of some wild dogs.\n\nDavid and the Short-Sighted Woman flee into the City. They go into a restaurant and sit together for a while. David goes into the bathroom and takes a knife with which he attempts to blind himself. We never find out if he goes through with it.\n", 
        "Rated": "R", 
        "Title": "The Lobster", 
        "Ratings": [
            {
                "Source": "Internet Movie Database", 
                "Value": "7.1/10"
            }, 
            {
                "Source": "Rotten Tomatoes", 
                "Value": "89%"
            }, 
            {
                "Source": "Metacritic", 
                "Value": "82/100"
            }
        ], 
        "DVD": "02 Aug 2016", 
        "Writer": "Yorgos Lanthimos, Efthymis Filippou", 
        "Production": "A24 Films", 
        "Actors": "Jacqueline Abrahams, Roger Ashton-Griffiths, Jessica Barden, Olivia Colman", 
        "Type": "movie", 
        "imdbVotes": "116,776", 
        "Website": "http://www.lobsterfilm.co.uk/", 
        "Poster": "https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ1NDE5NzQ1NF5BMl5BanBnXkFtZTgwNzA5OTM2NTE@._V1_SX300.jpg", 
        "Director": "Yorgos Lanthimos", 
        "Released": "16 Oct 2015", 
        "Awards": "Nominated for 1 Oscar. Another 22 wins & 64 nominations.", 
        "Genre": "Comedy, Drama, Romance", 
        "imdbRating": "7.1", 
        "Language": "English, French", 
        "Country": "Greece, Ireland, Netherlands, UK, France", 
        "BoxOffice": "$9,078,073.00", 
        "Runtime": "119 min", 
        "imdbID": "tt3464902", 
        "Metascore": "82", 
        "Response": "True", 
        "Year": "2015"
    }, 
    "tt3263904": {
        "Plot": "\nThe film opens with Captain Chesley \"Sully\" Sullenberger (Tom Hanks) trying to maneuver a plane above New York City. The plane's engines have both failed, and the pilot is trying to find a safe place to land. Sully loses control and crashes the plane into a building, resulting in a fiery explosion. This is just a nightmare, and Sully wakes up sweating and gasping for breath.\n\nIt's been barely a week since Sully successfully landed U.S. Airways Flight 1549 on the Hudson River, saving the lives of all 155 passengers in what the media has dubbed \"The Miracle on the Hudson\". However, Sully remains haunted by the incident.\n\nSully and his co-pilot/friend Jeff Skiles (Aaron Eckhart) are called in to meet with a board of people investigating the incident. One of the men, Charles Porter (Mike O'Malley), questions Sully over basic things such as if he had gotten enough sleep, whether or not he had taken any drugs or alcohol, or if he has been having troubles at home. The big question is why Sully chose to land on the Hudson instead of simply returning to LaGuardia Airport. Skiles defends Sully's actions as he was right next to him when the incident occurred. It is argued that the left engine had been determined to be idle and still functioning, but Sully disputes that and says that he felt both engines die.\n\nSully keeps in touch with his wife Lorraine (Laura Linney), who lives with their two daughters. Lorraine has been worried about Sully's well-being ever since the incident.\n?\n\nThe media also looks into the incident, with Sully being questioned by reporters. He sits for an interview with Katie Couric, who asks him what it feels like to be seen as a hero. Sully says he doesn't feel like a hero. Following the interview, Sully looks out the window and experiences another hallucination of his plane crashing into the city.\n\nWe see a brief flashback of Sully as a teenager when he was first learning to fly under LT Cook (Jeff Kober).\n\nSully and Skiles meet with the board again. They inform the pilots that several tests were run on a simulator that proved that it was possible and probable to return to LaGuardia.\n\nWe go back to the day of the incident on January 15th, 2009. Sully and Skiles take off, but roughly two minutes into the flight, a large flock of geese fly head-on into the engines, causing both of them to falter. Sully maintains contact with the people at the control center, but the flight is lost from the radar. Sully then warns everyone on board to brace for impact. The flight attendants mind the passengers and repeat instructions for them to be careful. Sully and Skiles then make their descent onto the Hudson.\n\nSully and Skiles make an appearance on David Letterman's show with the three flight attendants who were with them during the incident.\n\nSully goes jogging through Times Square and runs by the base where an old plane that he flew rests. We see a quick flashback of him flying that plane over a field. Afterwards, Sully goes to a bar where the bartender (Michael Rapaport) gives him a drink named after Sully - grey goose with a splash of water. Sully then watches coverage of the incident on the TV.\n\nWe see another flashback to that day, but with a more extensive look at the passengers. There's a woman with her elderly mother that wants to bring back a souvenir for her grandchildren. Two grown men are traveling with their father, and they just barely make it onto the plane before it departs. There is a woman with her baby and a polite man sitting next to her. We even meet the flight attendants joining the trip. As the plane malfunctions and begins its descent, the passengers brace themselves for the worst. Some are texting their loved ones, while others are holding on tight. The polite man holds the woman's baby for her. The plane lands on the river, and soon starts to fill up with water. Sully orders everyone to evacuate as the doors are opened and the rafts are inflated.\n\nA ferry team led by Captain Vincent Lombardi (playing himself) heads out into the Hudson to rescue the passengers, who have been separated onto both wings. At least two people have jumped into the freezing cold water, but both are recovered. The ferry team starts pulling people on board. Some people are brought to Jersey. One of the men that almost missed the flight calls his father, who is with his other son since they were separated, but they are elated to know that they're all okay.\n\nSully is brought to a hospital, and he is told that all 155 souls on board had survived. He is later brought to a hotel to stay, and one of the employees gives him a big hug, leaving him stunned. He calls Lorraine to let her know he is okay, even though she has no idea just yet of what has happened until Sully tells her to turn on the TV with their daughters.\n\nBack in the present, Lorraine calls Sully in tears as it just hits her that he was one of the 155 people on board, and how terrified she is to realize that.\n\nSully and Skiles attend a hearing with the board and other officials to discuss the incident. Again, it is brought up that all test pilots in the simulators were able to successfully make it back to LaGuardia without a problem. Sully argues that what they did not take into account was the \"human factor\", in that it was a matter of life and death, and that none of the test pilots were under the same pressure that he and Skiles were facing. The directors run tests again with the apparent reaction time of 35 seconds (Sully repeatedly mentions that he acted within 208 seconds), which show that had the test pilots reacted under the same circumstances, they all would have crashed into the city if they tried going back to LaGuardia. Even attempts at making it to Teterboro Airport would have proved fatal. Everyone then listens to a recording of Sully and Skiles on the flight as they made their moves. It is enough to prove to the board that Sully and Skiles acted properly. Dr. Elizabeth Davis (Anna Gunn) comments that if Sully had been removed from the equation, everything would have gone wrong. Sully disagrees, saying that Skiles and the flight attendants also deserve credit for the landing. Davis asks Skiles what they would have done differently. Skiles replies that he would have done this in July. Everyone laughs.\n\nThe final text states that it took about 24 minutes for the ferry team to rescue everyone from Flight 1549. The end credits feature pictures from the real event.\n", 
        "Rated": "PG-13", 
        "Title": "Sully", 
        "Ratings": [
            {
                "Source": "Internet Movie Database", 
                "Value": "7.5/10"
            }, 
            {
                "Source": "Rotten Tomatoes", 
                "Value": "85%"
            }, 
            {
                "Source": "Metacritic", 
                "Value": "74/100"
            }
        ], 
        "DVD": "20 Dec 2016", 
        "Writer": "Todd Komarnicki, Chesley Sullenberger (based on the book \"Highest Duty\" by), Jeffrey Zaslow (based on the book \"Highest Duty\" by)", 
        "Production": "Warner Bros.", 
        "Actors": "Tom Hanks, Aaron Eckhart, Valerie Mahaffey, Delphi Harrington", 
        "Type": "movie", 
        "imdbVotes": "128,445", 
        "Website": "http://www.sully-movie.com/", 
        "Poster": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NTUwNDIyOV5BMl5BanBnXkFtZTgwMjI2OTc3OTE@._V1_SX300.jpg", 
        "Director": "Clint Eastwood", 
        "Released": "09 Sep 2016", 
        "Awards": "Nominated for 1 Oscar. Another 8 wins & 27 nominations.", 
        "Genre": "Biography, Drama", 
        "imdbRating": "7.5", 
        "Language": "English", 
        "Country": "USA", 
        "BoxOffice": "$125,065,700.00", 
        "Runtime": "96 min", 
        "imdbID": "tt3263904", 
        "Metascore": "74", 
        "Response": "True", 
        "Year": "2016"
    }, 
    "tt2461150": {
        "Plot": "\nThe film is based on a true story.\n\n1997 - David Scott Ghantt (Zach Galifianakis) thought being an armored car driver would be a dream come true. He discovers that it's pretty boring stuff, and he often fantasizes about getting robbed. Everything changes when he meets Kelly Campbell (Kristen Wiig), a new employee at his bank, Loomis Fargo.\n\nDavid and Kelly hit it off at a shooting range where David accidentally shoots between his buttcheeks. He is in love with Kelly, but he is already engaged to Jandice (Kate McKinnon), a strange woman originally engaged to David's distant cousin before his death. David goes to an awkward engagement photo shoot.\n\nOne day at work, David and Kelly's boss yells at the two of them to go back to work, so Kelly stands up for David. She argues that even if she gets fired, she can collect unemployment. She pushes it too far when she pretends to sexually harass David and grab his belt, causing his gun to go off and shoot a window. Now she's definitely fired. Before Kelly leaves, David asks for her number. She adds the numbers 143 to the end since it means \"I love you\" to her, and it's sort of like a signature.\n\nKelly stays with her childhood friend Steve Chambers (Owen Wilson), his wife Michelle (Mary Elizabeth Ellis), their sons and two friends of Steve. After watching a news report on Phillip Johnson robbing from another Loomis Fargo bank, Steve concocts an idea to rob Loomis Fargo so they can escape their dead end lives and get away with some money. He persuades Kelly into getting in on the plan by getting David in on it since they know he likes Kelly.\n\nKelly gets in contact with David to bring him onto the plan, with Steve hiding his face from David but also giving him instructions. Since he would rather follow her than get married to Jandice, David agrees to help. She then guides him through some \"training\", which includes eating a tarantula since he may be living off the land after the plan goes off.\n\nThe team has David go inside the bank's vault and load as many bills as he can into the back of a truck. He nearly gets caught by another guard, but that man just assumes that David got overtime. Two hours later, David is done, and he breaks 3 cameras and steals two security tapes, but he misses one tape and another camera. He tries to close the backdoor but ends up locking himself in the back. He tapes some stacks of money together to drive the van through a door and into a ditch as the others watch. They are then amazed by how much money David has nabbed.\n\nThe money is counted and comes out to $17 million. David flees to Mexico to wait for Steve to send him money and to also lay low, with a bunch of money stuffed in his underpants already. However, Special Agent Scanlon (Leslie Jones) and her partner (Jon Daly) are already on the case, and Scanlon is pissed since the money stolen was federal agent money. They bring the security tape to Jandice and show her that David is guilty.\n\nAfter indulging in their share of the wealth, Steve thinks it's time to cut David loose since the FBI are after him, but Kelly thinks it would be wrong to screw David over now.\n?\n\nThree Interpol agents arrive at the hotel where David is staying to look for him. They miss him as he tries to refill his ice bucket, but the concierge rats him out. David flees and manages to escape. He dons a disguise to evade capture and then calls Kelly to tell her what happened. He looks through his pocket and finds a wallet with Steve's name and face on it. When he drops Steve's name, Kelly and Steve become worried.\n\nSteve hires dim-witted hitman Mike McKinney (Jason Sudeikis) to kill David. He goes down to Mexico to buy a gun, but he buys a wooden display gun that even the seller says isn't worth anything. When Mike attempts to kill David in the streets, the gun backfires and blows up in his face. He then goes after David after instigating a chase (he likes it that way), which results in multiple car accidents.\n\nScanlon goes around asking about David and how he can be found. Everyone tells her to go to Kelly. Scanlon and her partner talk to Kelly, who quietly breaks down when she realizes David is in trouble.\n\nMike eventually gets David by knocking him unconscious. He gets ready to cut David up until he looks at his ID and sees that Steve used Mike's own name and information to give David a fake ID. Thinking David was born under the same circumstances as him, Mike gives up trying to kill David because he thinks they were brought together by fate, so they become buddies.\n\nDavid calls Steve and demands that he send him money within two days, or else he will turn himself into the authorities and name-drop Steve first.\n\nKelly is at a clothing store when she is confronted by Jandice near the fitting rooms. She knows that Kelly was David's \"mistress\", and she attacks her. The two fight in front of everyone, with Kelly getting Jandice off by hitting her with a mannequin body. One of Steve's guys then follows Kelly.\n\nDavid calls back when he finds that Steve did not transfer money to his account. Steve then reveals that he has Kelly as a hostage, and he orders David to go to South America until he receives further instructions, or they will hurt Kelly.\n\nDavid is getting ready to leave from the airport, just as the same three Interpol agents are there looking for him. Mike is there too, because he is heading back to the States to kill Kelly under Steve's orders. When David finds out, he tells Mike who Kelly is, and Mike can't bring himself to kill David's woman. The agents show up and try to arrest David, but he and Mike beat them up. They trade plane tickets and say their farewells.\n\nSteve is holding a house party which David infiltrates to rescue Kelly. Scanlon gets one of Steve's neighbors (Ken Marino) to wear a wire to get a confession out of Steve. David breaks Kelly out of the shed where she is being held, and he steals Steve's BMW to make a getaway. Unfortunately, David's plan to burst out the gates backfires. Steve catches him and tries to beat him up, until David realizes he is near the police van with the detectives waiting for their confession. David tricks Steve into admitting that he was the mastermind of the whole plan, giving the detectives enough reason to arrest him.\n\nDavid and Kelly say goodbye just before they are hauled off to prison. Once David gets to prison, he is applauded by all the inmates for stealing the biggest amount of money in U.S. history. The story of the robbery becomes nationwide news, but it turns out that David stashed away $2 million in a barrel that he rolled into a lake. After serving seven years, Mike picks David up, and they head off to visit Kelly.\n\nThe final text states that Steve Chambers served 11 years in prison, and he now owns a fitness center. David Ghantt served 11 years and he occasionally works as a film consultant. The Loomis Fargo robbery was one of the biggest heists of all time, and $2 million of the stolen money remains unaccounted for to this day.\n", 
        "Rated": "PG-13", 
        "Title": "Masterminds", 
        "Ratings": [
            {
                "Source": "Internet Movie Database", 
                "Value": "5.8/10"
            }, 
            {
                "Source": "Rotten Tomatoes", 
                "Value": "33%"
            }, 
            {
                "Source": "Metacritic", 
                "Value": "47/100"
            }
        ], 
        "DVD": "31 Jan 2017", 
        "Writer": "Chris Bowman (screenplay), Hubbel Palmer (screenplay), Emily Spivey (screenplay), Emily Spivey (story), Chris Bowman (story), Hubbel Palmer (story)", 
        "Production": "Relativity Media", 
        "Actors": "Zach Galifianakis, Kristen Wiig, Owen Wilson, Ross Kimball", 
        "Type": "movie", 
        "imdbVotes": "22,213", 
        "Website": "https://www.facebook.com/MastermindsMovie", 
        "Poster": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMTY5Mzg1Ml5BMl5BanBnXkFtZTgwNTUzODUwNjE@._V1_SX300.jpg", 
        "Director": "Jared Hess", 
        "Released": "30 Sep 2016", 
        "Awards": "1 nomination.", 
        "Genre": "Action, Comedy, Crime", 
        "imdbRating": "5.8", 
        "Language": "English, Spanish", 
        "Country": "USA", 
        "BoxOffice": "$17,356,894.00", 
        "Runtime": "95 min", 
        "imdbID": "tt2461150", 
        "Metascore": "47", 
        "Response": "True", 
        "Year": "2016"
    }, 
    "tt1798603": {
        "Plot": "\nThe film starts with Willie Soke (Billy Bob Thornton) working as a valet driver at a country club. He gets distracted when he sees a woman breast-feeding her baby, causing him to crash into a stand and knock someone over. Willie gets fired on the spot after arguing with his superiors.\n\nWillie's voiceover catches us up on the last few years of his life. He thought he got his happy ending by being with Sue, but his screw-ups caught up to him before she left him. He prepares to kill himself by sticking his head in the oven. When that doesn't work, he tries to hang himself. His suicide attempt is interrupted by Thurman Merman (Brett Kelly), now 21 years old and dumber than ever, still following Willie around even though he no longer believes he's Santa Claus. He even works at a sandwich shop now to fulfill his passion for making people sandwiches. Willy drops from the ceiling as he tries to stop his suicide.\n\nThurman mentions that now that he's 21, he thinks Willie is going to \"pop his cherry\". Willie corrects him saying he would get it done by someone else. He calls Opal the prostitute (Octavia Spencer) to do the job, even though she isn't very willing. Thurman runs out of the motel room in a panic.\n\nWillie gets an unexpected visit from his old partner Marcus (Tony Cox), fresh out of prison. He mentions there's a job that needs to be worked on for $2 million in Chicago. Willie isn't very willing to join Marcus since he tried to kill him on their last job, but Marcus has apologized for that.\n?\n\nWillie and Marcus arrive in Chicago for Willie to discover that Marcus wants to rob Giving Way, a charity foundation. To make matters worse for Willie, not only does Marcus expect him to put on a Santa suit once more, he discovers that one of the people working on the charity is his horrible mother, Sunny (Kathy Bates), who constantly refers to Willie as \"shit stick\". Willie punches her in the face and storms out, telling Marcus he has absolutely no intention of working with his mother.\n\nMarcus and Sunny later meet with Willie in her apartment to discuss the whole deal with their plan. Sunny claims she's got Parkinson's and has a really bad cough. Willie still refuses to work with her until Marcus tries to talk him into it. Willie finally decides that he'll do the job, but once it's over, he and Marcus are cutting Sunny off.\n\nWillie puts on the Santa suit to go out and collect money for charity. Another Santa comes by and thinks Willie is operating on his turf. Although he calmly tries to get Willie to leave, Willie accuses the man of being a pervert and starts beating the crap out of him in front of a crowd before Willie gets arrested. Meanwhile, Marcus is crawling through a vent to locate the safe when he comes across the charity's manager, Regent Hastings (Ryan Hansen), is having an affair with his assistant and is also embezzling money from the charity already. Marcus nearly gets found out when Sunny calls him and his ringtone goes off.\n\nAfter Willie gets bailed out, he must go to an AA meeting with Diane (Christina Hendricks), Regent's wife. Afterwards, she talks about her struggle with alcohol addiction and how it led her to do dirty things. Willie thinks she's asking for it and tries to put the moves on her, but she is disgusted and kicks him out of the car. Moments later, Diane drives up to him and admits she does want sex since she and Regent haven't been intimate in over a decade. Willie then does it with Diane behind a dumpster in an alley. They don't know they're being followed by Dorfman (Jeff Skowron), a Giving Way security guard who Regent hired to take pictures of the two.\n\nMarcus tries to get a key to the charity's safe by attempting to seduce Gina (Jenny Zigrino), another security guard. After taking her out for a fancy dinner, Marcus tries to go to bed with her, but she turns him down because of his height.\n\nWillie meets up with Diane and they do it on some Christmas trees. He asks that she call him Santa like Sue did, so she does.\n\nWillie reluctantly starts to bond with Sunny as she tries to get close to him again. He notices how bad her cough is, so he steals some medicine from a pharmacy for her. Sunny later gives Willie a gun in case Marcus tries to double-cross him again.\n\nSunny later gets Willie to have sex with Gina for the keys since he has a thing for big girls. Gina is satisfied and Willie takes her keys. Marcus becomes upset after learning this and tries to attack Willie, but Willie manages to slam him onto a table.\n\nThurman has traveled all the way from Arizona to Chicago to be with Willie after learning that he went there himself. Willie is utterly displeased to see this and tries to leave Thurman somewhere alone before feeling guilty and deciding to drop Thurman off at a shelter full of degenerates to get him out of his hair. Thurman later goes by the charity and sees the children singing. He manages to get the director to let him sing as well, and she gives him a Santa suit to put on, which excites him.\n\nWillie, Marcus, and Sunny prepare for the robbery as the charity is holding its event where the children are singing. Sunny takes out the lights while Willie and Marcus try to open the safe. Willie stops and sees Thurman getting up to sing in his Santa suit. Willie is surprised to see that Thurman has a lovely voice, and it even moves him to tears. When Willie and Marcus finally open the safe, Marcus reveals he really was trying to double-cross Willie. Willie gets his gun and gets the money out of there before the guards come after them.\n\nWillie and Marcus bring the money outside, but Sunny reveals that she was going to take the money all for herself. She shoots Marcus in the chest and runs him over with her van as she tries to get away. Willie goes after her and chases her into SantaCon. Willie manages to find her, and Sunny ends up shooting Willie as well. He grabs her bag and lets all the money fly out. Sunny tries to shoot Willie again, but Thurman shows up and jumps in, getting himself shot in the butt. The cops arrive and arrest Sunny while the medics take Willie and Thurman away.\n\nWillie wakes up in the hospital getting a handjob from Diane, meaning he finally got his \"happy ending\". His voiceover reveals that he tipped the cops off about Sunny, meaning he managed to avoid jailtime once again. Regent's embezzlement scheme was discovered and he was booted from the charity. He has decided to keep Thurman around as company since he has decided his new family is way better than his old one. Willie now works as a janitor in the hospital, and he finds Marcus's room. He considers smothering him to death, but Willie gets his revenge by teabagging a helpless Marcus and posting pictures on Instagram.\n", 
        "Rated": "R", 
        "Title": "Bad Santa 2", 
        "Ratings": [
            {
                "Source": "Internet Movie Database", 
                "Value": "5.5/10"
            }, 
            {
                "Source": "Rotten Tomatoes", 
                "Value": "23%"
            }, 
            {
                "Source": "Metacritic", 
                "Value": "38/100"
            }
        ], 
        "DVD": "21 Feb 2017", 
        "Writer": "Johnny Rosenthal, Shauna Cross, Glenn Ficarra (based on characters created by), John Requa (based on characters created by)", 
        "Production": "Miramax/Broad Green", 
        "Actors": "Billy Bob Thornton, Kathy Bates, Tony Cox, Christina Hendricks", 
        "Type": "movie", 
        "imdbVotes": "8,783", 
        "Website": "http://www.badsanta2.com/", 
        "Poster": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MjE5Mzc4OF5BMl5BanBnXkFtZTgwMjc3NjEyMDI@._V1_SX300.jpg", 
        "Director": "Mark Waters", 
        "Released": "23 Nov 2016", 
        "Awards": "N/A", 
        "Genre": "Comedy, Crime, Drama", 
        "imdbRating": "5.5", 
        "Language": "English", 
        "Country": "USA", 
        "BoxOffice": "$17,664,973.00", 
        "Runtime": "92 min", 
        "imdbID": "tt1798603", 
        "Metascore": "38", 
        "Response": "True", 
        "Year": "2016"
    }, 
    "tt0004972": {
        "Plot": "\nThe film opens with a dream sequence of a young Nat Turner (Tony Espinosa) being taken into the woods to meet with a tribe. The tribe leader notes that children that were marked at birth (Nat has three vertical marks going down his chest) were meant to be chosen for something important.\n\nSouthampton County, Virginia, 1809 - Nat lives as a slave with his mother Nancy (Aunjanue Ellis), father Isaac (Dwight Henry), and grandmother Bridget (Esther Scott). They are owned by the Turner family. Nat frequently plays with the Turner's young son Samuel. After his mother Elizabeth (Penelope Ann Miller) calls her in, Nat spots a book sitting on the rocking chair on the porch.\n\nAt night, Isaac is caught stealing food by three white men led by Raymond Cobb (Jackie Earle Haley). Isaac is nearly shot, but he grabs Cobb's gun and causes one of the men to get shot in the head. Isaac flees and spots Nat in the woods. He takes him back home to safety. Isaac tells Nancy that he must leave. Cobb and another man show up at Nat's house to find out where Isaac is. Nancy and Bridget say they don't know, and Nat never speaks a word.\n\nElizabeth speaks to Nancy as she is hanging up the laundry. She tells Nancy that she found out Nat knows how to read, to his mother's disbelief. Elizabeth offers to teach Nat to read. She brings him into the house and teaches him with the Bible. Nat is later seen giving a sermon at church.\n?\n\nBenjamin Turner passes away, so Nat is taken in by the Turner family to work on the field. He picks cotton for years, until he is an adult man (now played by Nate Parker). He and Samuel (now played by Armie Hammer) are riding by a slave auction. Nat is taken by a \"wench\" named Cherry (Aja Naomi King) that is being sold off. He convinces Samuel to buy her for $275.\n\nOn the way home, Nat picks up a toy for a white boy and informs his thankful mother, but her husband smacks Nat with a rod for talking to his wife. He continues to hit Nat until Nat grabs the rod. The man complains to Samuel that Nat assaulted him and his wife, but Samuel threatens to retaliate if the man doesn't leave Nat alone. When they get home, Nat speaks to Cherry, who attacks him. She is pulled off and later fixed up to look nicer so she may be given to Samuel's sister Catherine (Katie Garfield).\n\nReverend Walthall (Mark Boone Jr.) approaches Samuel and suggests that Nat go on a tour to preach to the other slaves in the county, and in return, Samuel and his family would receive monetary compensation.\n\nNat gets closer to Cherry, whose real name is Madison. Eventually, Nat proposes, and they are married in the woods by Bridget. Over the years, as Nat does his work in preaching, they become parents to a girl named Joanna.\n\nOn Nat's travels in his preachings, he becomes aware of the cruelty of the plantation owners toward their slaves. Nat and Samuel watch as a man breaks out all of a slave's teeth and force-feed him through a funnel. In another instance, he sees as one of Samuel's friends requests a married slave, Esther (Gabrielle Union), to his quarters. She later exits the house in tears as her husband goes to console her and ask Nat where God is now.\n\nCobb and his men find Cherry in the woods doing a chore. They violently assault her, and Nat goes home to find her battered face as she lies in bed.\n\nNat's preaching becomes more impassioned, but he no longer holds any respect for his owners. When he talks back to Samuel and Walthall, Samuel whacks Nat in the mouth with the butt of his rifle. Nat is then brought into the middle of the town for a whipping.\n\nNat's wounds are later treated by Bridget, who discusses her experiences of seeing acts such as this. Later, Bridget dies in her rocking chair. Nat buries her in the yard.\n\nNat gathers a number of slaves in the community and rounds them up at night. They go into Samuel's home, where Nat strikes him in the chest with a hatchet. Samuel crawls out of his room before succumbing to the wound. The slaves go around to numerous houses to kill white men. One slave decapitates a man in front of his own house. A group of white men find the slaves in the woods and start shooting at them after a young slave boy informs the men of Nat's actions.\n\nNat and his group are later confronted by Cobb and an angry mob of men. They charge into battle and brutally attack one another. Cobb shoots Nat through the shoulder and tries to kill him. Nat grabs his knife and sticks it through Cobb's throat. The surviving slaves retreat as soldiers arrive. Nat and two other men are cornered in a barn. The soldiers blast through the barn with a cannon. Only Nat survives.\n\nThe white men retaliate against the black community by killing many people, regardless of whether or not they are slaves or freed. Nat finds Cherry doing a chore, but he speaks to her while staying hidden. She says she, Joanna, and Nancy are all safe, but the killing won't stop until Nat is found.\n\nNat turns himself in before an angry group of people. They begin to beat and kick him down, but the sheriff orders them to stop and wait for Nat to be hanged.\n\nNat is brought to the gallows in front of a large crowd, made up of both black and white people. The white people jeer and shout insults at Nat while some manage to strike him. The black people are silent as they watch Nat being taken to his death. When asked if he has any last words, he simply says, \"I'm ready.\" Nat is hung until dead, and the last thing he sees is Cherry in the form of an angel. We then see the boy that alerted the men earlier during the uprising, watching with tears in his eyes. The final shot jumps forward to his adulthood as he fights alongside other black soldiers in the war.\n\nThe closing text reads that the rebellion lasted nearly 48 hours, and over 60 white individuals were killed, leading to an even larger number in deaths of black individuals. Nat Turner's body was dismembered, flayed, and his remains were made into relics, all for the sake of preventing a legacy.\n", 
        "Rated": "NOT RATED", 
        "Title": "The Birth of a Nation", 
        "Ratings": [
            {
                "Source": "Internet Movie Database", 
                "Value": "6.7/10"
            }, 
            {
                "Source": "Rotten Tomatoes", 
                "Value": "100%"
            }
        ], 
        "DVD": "29 Jun 2004", 
        "Writer": "Thomas Dixon Jr. (adapted from his novel: \"The Clansman: An Historical Romance of the Ku Klux Klan\"), Thomas Dixon Jr. (play), Thomas Dixon Jr. (novel), D.W. Griffith, Frank E. Woods", 
        "Production": "Gravitas", 
        "Actors": "Lillian Gish, Mae Marsh, Henry B. Walthall, Miriam Cooper", 
        "Type": "movie", 
        "imdbVotes": "17,837", 
        "Website": "N/A", 
        "Poster": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODUwNDc3NV5BMl5BanBnXkFtZTgwNDE3NTU4MDE@._V1_SX300.jpg", 
        "Director": "D.W. Griffith", 
        "Released": "21 Mar 1915", 
        "Awards": "2 wins.", 
        "Genre": "Drama, History, War", 
        "imdbRating": "6.7", 
        "Language": "N/A", 
        "Country": "USA", 
        "BoxOffice": "N/A", 
        "Runtime": "165 min", 
        "imdbID": "tt0004972", 
        "Metascore": "N/A", 
        "Response": "True", 
        "Year": "1915"
    }, 
    "tt3531824": {
        "Plot": "\nVenus \"Vee\" Delmonico (Emma Roberts) is a high school senior living on Staten Island. She surfs the web and gets a Facebook notification from her crush, J.P. (Brian Marc), who tagged her in a photo that she took. Vee gets a Skype chat invitation from her friend Sydney (Emily Meade). Syd mentions a game called Nerve that is about to launch for the next 24 hours. The game involves \"watchers\" and \"players\" - the players are given dares to do in exchange for money, while the watchers pay to watch everything happen. Syd has signed on to play and encourages Vee to join her, but she declines.\n\nVee wants to go away for college but is worried about leaving her mom Nancy (Juliette Lewis) behind all by herself. It's been years since Vee's brother died, and neither of them have really gotten over it.\n\nAt school, Vee takes photos for the yearbook, but most of them feature J.P. She joins her friends Tommy (Miles Heizer), Liv (Kimiko Glenn) and Wes (Marc John Jeffries) at a pep rally. Syd gives Liv her phone to record her dare. She joins her fellow cheerleaders and moons the entire school. Her dare is complete.\n\nThe gang later goes out to eat. Syd keeps trying to get Vee to join Nerve since Vee never takes risks. They see J.P. sitting with his buddies. Syd decides to go over and talk to J.P. for her. She asks him if he would be interested in going out with Vee, but J.P. says she's not his type. Upset, Vee leaves and goes home. She logs onto Nerve and is told the rules before she makes a move. Dares must be recorded on the players' phones, and if they bail or fail, they lose their money. Also, nobody can snitch on Nerve, or it'll end very badly. Vee decides to become a player. Immediately, Nerve starts to obtain all of Vee's personal information.\n\nVee calls Tommy to take her to a diner for her first dare. She must kiss a stranger for five seconds to get $100. The clock is ticking as she hesitates to pick someone. She spots a guy named Ian (Dave Franco) reading her favorite book, Virginia Woolf's \"To The Lighthouse\". Vee kisses him while Tommy records. The dare is done. Vee goes over to Tommy, who is more annoyed than anything (he secretly likes Vee). When she turns around, Ian is gone. He is then spotted going all around the diner singing and putting on a grand performance as part of his dare. He goes to Vee's table, and she is dared to go to the city with him for $200. Although uncertain at first, Vee joins Ian on his motorcycle, leaving Tommy behind.\n\nVee and Ian make it into the city and part ways. She then gets a new dare to try on a couture dress. Vee tries it on and then finds Ian in the same store trying on a suit. When they go back into their dressing rooms, they find all of their stuff is gone. The next dare for both of them is to leave the store. They remove their clothes and leave in their underwear. A bunch of watchers record them as they leave. They find the clothes from the store on Ian's motorcycle for them to keep. Their phones then buzz for the next dare. Before they head out, a player named Ty (Machine Gun Kelly) passes them and comments on their dares, and he also implies that he personally knows Ian.\n\nTommy stays at the diner and decides to watch what Vee is doing. He gets in touch with his hacker friend Azhar (Samira Wiley) and asks for \"a ticket to Aruba\". Azhar thinks it's risky, but she sends him a code for access to a site called Aruba. Tommy discovers past videos of Ian playing Nerve a year earlier. He stole the motorcycle and was hanging from a crane with two other guys.\n?\n\nSyd is going around the city with Liv and Wes to continue her dares while gaining more followers. She becomes displeased when she learns Vee is catching up to her watcher count.\n\nVee and Ian go to a tattoo parlor. Ian draws a secret tattoo for Vee to get. It turns out to be a lighthouse as a nod to her favorite book.\n\nNancy then notices that money is being transferred into her and Vee's joint account. She calls Tommy to ask what's going on. Tommy, unable to snitch, says Vee got a job and is having money transferred to her account.\n\nVee and Ian then ride a carousel. Syd and her friends watch at a house party. Vee talks about joining Nerve to get Syd off her back, claiming that she always makes it look like Vee is insecure when it's really Syd that is insecure, and how she always has guys come over when her parents are away. Hurt, Syd seeks out a new dare. She encounters Ty at the party, who suggests that she team up with him. Syd declines. Ian then suggests to Vee that they go to the party.\n\nSyd gets really drunk and is then dared to walk across a ladder from one apartment to the next. It's especially terrifying for Syd because she's afraid of heights. After making it halfway, Syd slips and drops her phone. She bails out of Nerve.\n\nVee and Ian arrive at the party. Syd takes the chance to call Vee out on what she said, leading to a huge fight between them, leaving Syd humiliated. Vee decides to complete Syd's dare and she walks across the ladder almost effortlessly. When she goes back to make up with Syd, she finds her making out with J.P. Vee then learns that Ian was dared to go to the party to get Vee and Syd to fight. Angered, Vee decides to tell the cops. Ian runs after her and pleads with her not to do that, but she doesn't listen. Vee sees a cop and tells him about Nerve, but he does nothing. Nancy then calls Vee and says all the money in their account has been taken. Now alone, Vee comes across Ty, who says he has to win the game, and he knocks her out cold.\n\nVee wakes up in a freight container with \"SNITCHES GET STITCHES\" painted on the walls. A TV in the container turns on with a computer voice telling Vee that because she snitched, Nerve now controls her life, family, and future. The only way for her to escape is to win the game. She gets out of the container and is told to get on the ferry. She runs into Ian, who explains to her that like him, she is now a prisoner of the game. For Ian, it happened a year earlier when he, Ty, and a third guy named Robbie were dared to hang from a crane. Robbie slipped and fell to his death. Ian and Ty went to the cops, but Nerve ruined their lives and took away his money and his father's job. Ian says he will do a dare that places him ahead of Ty so that he and Vee can make it to the finals.\n\nVee meets up with Tommy and Syd, where she reconciles with both of them. They get in touch with certain people as part of a plan. Meanwhile, Ian takes a dare in which he must hang from a crane with one hand for five seconds. He succeeds and advances to the final. Vee goes through the city and must pick up a package, which turns out to be a loaded gun.\n\nVee and Ian make it to an arena in front of over a hundred watchers for the final round. Tommy and Syd meet up with Azhar to hack into Nerve's server, and Nancy meets with them there to watch the final round. The dare involves Vee and Ian having to shoot each other. Ian tells Vee to shoot him so she can win. Vee refuses. Ty appears and says he will shoot one of them. The watchers cheer him on. Vee decides to take the shot over Ian. As everyone records, she calls everyone out on wanting to watch someone die for the sake of their entertainment. Nerve then decides to put Vee's life to a vote. The majority votes YES for her to get shot. Ty fires the gun, and Vee goes down in Ian's arms. Every watcher then has their names exposed and a message notifying them that they are accessories to murder, with the option to sign out. Everyone does, allowing Azhar to crash Nerve's server and shut it down for good. Vee then reveals she was alive, having orchestrated the whole thing with Ty involved (he fired a blank).\n\nEverything goes back to normal, and Azhar makes it so that Vee and Nancy get their money back. Vee and Ian (who says his real name is Sam) decide to pursue a relationship. They share a kiss as the sun rises on a new day.\n", 
        "Rated": "PG-13", 
        "Title": "Nerve", 
        "Ratings": [
            {
                "Source": "Internet Movie Database", 
                "Value": "6.6/10"
            }, 
            {
                "Source": "Rotten Tomatoes", 
                "Value": "66%"
            }, 
            {
                "Source": "Metacritic", 
                "Value": "58/100"
            }
        ], 
        "DVD": "25 Oct 2016", 
        "Writer": "Jeanne Ryan (novel), Jessica Sharzer (screenplay)", 
        "Production": "Keep Your Head", 
        "Actors": "Emma Roberts, Dave Franco, Emily Meade, Miles Heizer", 
        "Type": "movie", 
        "imdbVotes": "63,393", 
        "Website": "http://www.playnerve.com/", 
        "Poster": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzOTg1OTM4NV5BMl5BanBnXkFtZTgwMTg2Mjg0OTE@._V1_SX300.jpg", 
        "Director": "Henry Joost, Ariel Schulman", 
        "Released": "27 Jul 2016", 
        "Awards": "2 nominations.", 
        "Genre": "Adventure, Crime, Mystery", 
        "imdbRating": "6.6", 
        "Language": "English", 
        "Country": "USA", 
        "BoxOffice": "$38,562,379.00", 
        "Runtime": "96 min", 
        "imdbID": "tt3531824", 
        "Metascore": "58", 
        "Response": "True", 
        "Year": "2016"
    }
}